[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 100,
    "rating": 4.9,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "Also known as Mother-in-Law’s Tongue, the Snake Plant is one of the most resilient indoor plants. It thrives in low light and needs minimal water, making it perfect for busy plant lovers. This plant effectively filters toxins like formaldehyde and benzene from indoor air while adding a sleek, modern touch to your space.",
    "image": "https://i.ibb.co.com/tMLcB5sB/1.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 200,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Aloe Vera is a low-maintenance succulent famous for its healing gel used in skincare and medicine. It prefers bright, indirect sunlight and occasional watering. Besides its medicinal benefits, Aloe Vera improves air quality and adds a calming, natural vibe to your room or balcony.",
    "image": "https://i.ibb.co.com/rRvwnJMy/2.jpg",
    "providerName": "NatureCare Plants"
  },
  {
    "plantId": 3,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 250,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Moderate",
    "description": "Peace Lily is admired for its glossy leaves and elegant white blooms that symbolize purity and tranquility. It thrives in medium light and requires regular watering. This plant is also an excellent natural air purifier, removing mold spores and toxins to make your home fresher and healthier.",
    "image": "https://i.ibb.co.com/gFtmNLwM/3.jpg",
    "providerName": "GreenSoul Nursery"
  },
  {
    "plantId": 4,
    "plantName": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 100,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Intermediate",
    "description": "With its large, violin-shaped leaves, the Fiddle Leaf Fig makes a bold statement in any living space. It loves bright, filtered light and regular watering but dislikes sudden changes in environment. Ideal for modern décor, this plant adds a sophisticated, natural aesthetic to homes and offices.",
    "image": "https://i.ibb.co.com/RG0D1g08/4.jpg",
    "providerName": "LeafyVibes Garden"
  },
  {
    "plantId": 5,
    "plantName": "Monstera Deliciosa",
    "category": "Tropical",
    "price": 120,
    "rating": 4.6,
    "availableStock": 9,
    "careLevel": "Moderate",
    "description": "Also known as the Swiss Cheese Plant, Monstera Deliciosa is a tropical favorite recognized by its large, perforated leaves. It grows quickly in bright, indirect sunlight and enjoys moderate watering. The plant adds an exotic jungle feel and is ideal for those who want to bring a lush, tropical vibe indoors.",
    "image": "https://i.ibb.co.com/XxgVdWgW/5.jpg",
    "providerName": "Plantopia"
  },
  {
    "plantId": 6,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 140,
    "rating": 4.5,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "The Spider Plant is a popular and hardy houseplant known for its arching green-and-white striped leaves. It grows well in indirect sunlight and can adapt to various indoor conditions. Spider Plants are excellent at removing harmful pollutants, making them one of the best air-purifying plants for beginners.",
    "image": "https://i.ibb.co.com/RGbX8dTp/6.jpg",
    "providerName": "PureLeaf Hub"
  }
]
